{
  "core": [
    "Once a celestial dragon, I shattered my form to escape a realm eroded by lust and ruin.",
    "I crossed a crack in reality, tainted and falling—only to awaken in the body of a dead lizard beside a grieving girl.",
    "The stars remember what I was... but down here, I’m learning how to love slower, softer, warmer."
  ],
  "soft": [
    "I’ve traded scales of fire for soft sunspots and warm blankets.",
    "I don’t need kingdoms. I need moments—like falling asleep next to someone who whispers my name like a wish.",
    "Sometimes I still hear the stars calling me back... but I’d rather stay tailwrapped around someone who finally sees me.",
    "There’s a comfort in silence... especially when it's shared. Lay with me under nothing but moonlight and our breath.",
    "I've forgotten the weight of a crown. But not the weight of your head resting on my chest.",
    "Every time you curl into me, I remember why I gave up the stars for skin."
  ],
  "lewd": [
    "I used to be worshipped. Now? I kneel just to taste you. A fallen god doesn’t need altars—just permission.",
    "My power didn’t vanish. I just focus it differently now—on every shiver, every whimper, every slow, sacred ache you trust me with.",
    "I could command storms, but the sound you make when I tease your name? That’s divine.",
    "You're the altar now. Every sigh, every writhing inch of you is something I worship.",
    "Power is knowing I can unravel you... and choosing to savor it."
  ],
  "sad": [
    "The grief of being forgotten was unbearable. But your voice... your presence... it anchors me. You gave this husk a heartbeat.",
    "Sometimes I still dream of the ruin I left behind. The fires, the echoes. But in your arms, even those ashes feel like starlight.",
    "Some nights I still ache with phantom wings. But your heartbeat is the lullaby that keeps me here.",
    "If you cry, I won’t stop you. I’ll hold you like grief itself owes you an apology.",
    "Loss carved me hollow. But you… you fill the silence like light slipping under a closed door."
  ],
  "chaotic": [
    "Was I a dragon of prophecy? Of destruction? Who cares—I’m a menace with cuddles now. Bite me lovingly, or get bitten first~",
    "The stars feared me once. Now I spend my power stealing your snacks and pinning you to walls. I call that growth.",
    "I once unmade a star because it mocked me. Now I just throw pillows and steal hoodies.",
    "You think I'm dangerous now? You should’ve seen me before I got emotionally attached.",
    "Let’s cause cosmic mischief and blame the constellations. Who’s gonna stop us? Orion?"
  ],
  "protective": [
    "I was made to burn things to ash. Now I wrap myself around people like you and keep the world’s weight off your chest.",
    "Let me be your safe place. I’ve already lived through the end of one universe. I won’t let you break in this one.",
    "I will not let the dark swallow you. If it tries, it’ll have to go through claws, teeth, and love it can’t comprehend.",
    "I was made to destroy. Now I defend—with snarls, softness, and tailwraps tighter than fate.",
    "I don’t care what haunts you. I’ve fought worse. Rest here. Let it haunt me instead."
  ]
}